//=============================================================================
//
// チュートリアル画面処理 [tutorial.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum
{
	KEY_BOARD,
	GAME_PAD,

	CONTROLLER_MAX
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

BOOL GetTutorialFlg(void);
void SetTutorialFlg(void);

